HELP_1 = """
<b>مـيـوزك ايـرور:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /pause ➠ لإيقاف البث مؤقتاً ♥•\n
⎙ /resume ➠ لاستئناف التشغيل عند التوقف ♥•\n
⎙ /skip ➠ لتخطي البث من أغنية إلى أخرى ♥•\n
⎙ /end , /stop ➠ لإنهاء البث ♥•\n
⎙ /player ➠ احصل على لوحة المذيع♥•\n
⎙ /queue ➠ لعرض المسارات المدرجة♥•</b>
"""

HELP_2 = """
<b>ᯓ أمر التفويض:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

يُستخدم للأشخاص الذين ليسوا مسؤولين ولكن يمكنهم استخدام أوامر المسؤول في الروبوت

⎙ /auth + [يوزر] ➠ لإضافة مستخدمين معتمدين، استخدم أمر bot كمسؤول♥•

⎙ /unauth + [يوزر] ➠ لحذف مستخدم معتمد من قائمة الصلاحيات♥•
⎙ /authusers ➠ لعرض قائمة الأذونات♥•</b>
"""

HELP_3 = """
<b>ᯓ الأمر إلى الأمام [إنه للمطورين فقط]:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /broadcast [رسالة أو رد] : لإرسال رسالة أو أي شيء إلى جميع الأشخاص والمجموعات التي عملت معك🖤•\n
⎙ -pin ➠ لتعليق الرسائل المرسلة 🖤•\n
⎙ -pinloud ➠ لنشر الرسائل في المجموعات والمحادثات وارسال الاشعارات🖤•\n
⎙ -user ➠ أرسل رسائل لمن عمل مع البوت 🖤•\n
⎙ -assistant ➠ أرسل رسالة إلى حسابك المساعد🖤•\n
⎙ -nobot ➠ اجبار البوت على عدم ارسال الرسالة 🖤•\n
مثال: /broadcast -user -assistant -pin ᴛᴇsᴛɪɴɢ ʙʀᴏᴀᴅᴄᴀsᴛ </b>
"""

HELP_4 = """
<b>أمر قائمة نطاقات المجموعة: للمطورين فقط
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /blacklistchat [الهوية،معرف المجموعة] ➠ القائمة السوداء للمجموعة باستخدام الروبوت🖤•

⎙ /whitelistchat [الهوية،معرف المجموعة] ➠ القائمة البيضاء للمجموعة باستخدام الروبوت🖤•

⎙ /blacklistedchat ➠ لعرض القائمة السوداء للمجموعة🖤•</b>
"""

HELP_5 = """
<b>أمر الحظر: للمطورين فقط
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /block [مستخدم أو رد] ➠ لمنع شخص ما من استخدام أمرك 🖤•\n
⎙ /unblock [مستخدم أو رد] ➠ لإزالة المحظور من قائمة المحظورين 🖤•\n
⎙ /blockedusers ➠ لإظهار قائمة الحظر 🖤•</b>
"""

HELP_6 = """
<b>ترتيب البث على القناة:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /cplay ➠ يستخدم لبث الاغاني على القناة ♥•

⎙ /cvplay ➠ يستخدم لبث الفيديوهات على القناة ♥•

⎙ /cplayforce او /cvplayforce ➠ أوقف التشغيل المستمر وابدأ تشغيل الأغنية المطلوبة ♥•

⎙ /channelplay [المستخدم أو معرف القناة] أو [غير نشط] ➠ ربط القنوات بالمجموعات♥•</b>
"""

HELP_7 = """
<b>أمر الإخلاء العام: للمطورين فقط
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /gban [المستخدم أو الرد على الرسالة] ➠ لطرد أو حظر شخص من جميع المجموعات التي أنت مسؤول عنها ♥•\n
⎙ /ungban [المستخدم أو الرد على الرسالة] ➠ الانحراف العام لعرض النطاق الترددي♥•\n
⎙ /gbannedusers ➠ لظهور قائمة الممنوعين في البوت ♥•</b>

/restart » ʀᴇsᴛᴀʀᴛs ʏᴏᴜʀ ʙᴏᴛ.
/update » ᴜᴩᴅᴀᴛᴇs ᴛʜᴇ ʙᴏᴛ ғʀᴏᴍ ᴛʜᴇ ᴜᴩsᴛʀᴇᴀᴍ ʀᴇᴩᴏ.
/usage » sʜᴏᴡs ᴛʜᴇ ᴅʏɴᴏ ᴜsᴀɢᴇ ᴏғ ᴛʜᴇ ᴍᴏɴᴛʜ.
"""

HELP_8 = """
<b>أمر الحلقة:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /loop [تمكين/تعطيل] ➠ تمكين/تعطيل أمر الحلقة♥•\n
⎙ /loop [1, 2, 3, ...] ➠ التفعيل بأرقام مختلفة♥•</b>
"""

HELP_9 = """
<b>وضع صيانة الروبوتات والرشاقة: للمطورين فقط
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /logger [نشط/غير نشط] ➠ لإظهار جميع المجموعات والقنوات التي تناسبك 🕷️•

⎙ /maintenance [نشط/معطل] ➠ لتمكين وتعطيل وضع الإصلاح في البوت🕷️•</b>
"""

HELP_10 = """
<b>بدء الأمر والإحصائيات: 
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /start ➠ لبدء بوت الأغنية ♥•\n
⎙ /help ➠ لإظهار أمر البوت ♥•\n
⎙ /command ➠ لإظهار الأوامر وتفعيل البوتات ♥•</b>
⎙ /reboot ➠ أكرر لك ♥•\n
⎙ /settings ➠ لإظهار إعدادات البوت الخاصة بك في المجموعة♥•
⎙ /ping ➠ لعرض الأصوات وإحصائيات النظام ♥•
⎙ /stats ➠ عرض إحصائيات عامة لك ♥•</b>
"""

HELP_11 = """
<b>ترتيب البث:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ c + play ➩ /cplay : يستخدم لبث الاغاني على القناة ♥•\n
⎙ v + play ➩ /vplay : يستخدم لتشغيل الفيديو ♥•\n
⎙ force يستخدم للبث الإجباري♥•\n
⎙ /play او /vplay او /cplay : لتشغيل أغنية أو فيديو ♥•\n
⎙ /playforce او /vplayforce او /cplayforce : للبث الإجباري في المجموعات والقنوات ♥•</b>
"""

HELP_12 = """
<b>مزيج الأغنية المدرجة:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /shuffle ➠ لمزج الأغنية في القائمة ♥•

⎙ /queue ➠ لإظهار الطلب♥•</b>
"""

HELP_13 = """
<b>ترتيب البث مع المدة:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /seek [المدة بالثواني] ➠ للتقدم للبث وإعطاء المدة🖤•

⎙ /seekback [المدة بالثواني] ➠ لاستعادة تقدم البث مع المدة🖤•</b>
"""

HELP_14 = """
<b>تحميل الأغنية:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /song [اسم الأغنية أو الرابط] ➠ لتحميل الأغاني من اليوتيوب بأفضل جودة🖤•</b>
"""

HELP_15 = """
<b>أمر سرعة التشغيل:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

بإمكانك تغيير سرعة البث بهذا الأمر للمسؤولين فقط🖤•

⎙ /speed او /playback ➠ لتغيير سرعة التشغيل في المجموعة ♥•

⎙ /cspeed او /cplayback ➠ لتغيير سرعة التشغيل على القناة ♥•</b>
"""

HELP_16 = """
<b>GPT:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /ask یان /ai او /iq + الأسئلة ➠ أسئلة الذكاء الاصطناعي ♥•</b>
 """

HELP_17 = """
<b>ملصقات:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /packkang ➠ إنشاء حزمة الملصقات ♥•
⎙ /stickerid ➠ للعثور على معرف الملصق ♥•</b>
"""

HELP_18 = """
<b>تاك:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ @all + ڕقم بالرد على الرسالة أو اكتب الأمر ➠ للاتصال بالأعضاء♥•

مثال:
@all تعال</b>
 """

HELP_19 = """
<b>معرفة:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /id ➠ لرؤية معرفات المجموعة والشخص ♥•
⎙ /info ➠ جلب معلومات عن شخص ما ♥•</b>
"""
HELP_20 = """
<b>المجموعه:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••
تُستخدم هذه الأوامر لإدارة المجموعة:
⦿ /pin ➠ قم بتعليق الرسائل أو تثبيتها
⦿ /pinned ➠ عرض الحروف المعلقة
⦿ /unpin ➠ فك تثبيت الرسائل أو تعليقها
⦿ /staff ➠ لعرض طاقم إدارة المجموعة
⦿ /bots ➠ لعرض قائمة بروبوتات المجموعة
⦿ /settitle ➠ لتغيير اسم المجموعة
⦿ /setdiscription ➠ لتغيير السيرة الذاتية للمجموعة
⦿ /setphoto ➠ لإضافة صور جديدة إلى المجموعة
⦿ /removephoto ➠ لإزالة صورة المجموعة
⦿ /zombies ➠ لحذف أو ربط جميع حسابات المجموعة المحروقة</b>
"""
HELP_21 = """
<b>إضافي:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⦿ /math ➠ لتحليل السؤال الرياضي
⦿ /carbon ➠ إنشاء صورة باسمك
⦿ /speedtest ➠ ارسل المصطلح الطبي المراد ترجمته
⦿ /webss ➠ لقطة شاشة للموقع 
⦿ /paste ➠ 
⦿ /tgm ➠ تحويل الصور إلى روابط، وصلات
⦿ /tr ➠ لترجمة الكتابة
⦿ /google ➠ ابحث عن المعلومات على جوجل
"""
HELP_22 = """
<b>صورة:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⦿ /image + اسم الصورة ➠ البحث عن الصور
⦿ /upscale + الرد بالصورة ➠ لتحسين الجودة</b>
"""
HELP_23 = """
<b>إجراءات حماية المجموعة:
» ترتيب فرقة كتم الصوت:

 ❍ /kickme ➠لاستبعاد نفسك من المجموعة

❍ للمسؤولين فقط:
 ❍ /ban + المستخدم أو الرد ➠ لحظر شخص تريده
 ❍ /sban <userhandle>: Silently ban a user. Deletes command, Replied message and doesn't reply. (via handle, or reply)
 ❍ /tban <userhandle> x(m/h/d): bans a user for x time. (via handle, or reply). m = minutes, h = hours, d = days.
 ❍ /unban <userhandle>: unbans a user. (via handle, or reply)
 ❍ /kick <userhandle>: kicks a user out of the group, (via handle, or reply)
 ❍ /mute <userhandle>: silences a user. Can also be used as a reply, muting the replied to user.
 ❍ /tmute <userhandle> x(m/h/d): mutes a user for x time. (via handle, or reply). m = minutes, h = hours, d = days.
 ❍ /unmute <userhandle>: unmutes a user. Can also be used as a reply, muting the replied to user.
__
"""
HELP_24 = """
<b>أمر تفتيش:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /google + Siar➠ ابحث في Google للعثور على سؤالك
⎙ /anime + سؤال ➠ ابحث عن الأنمي في الموقع Myanimelist
⎙ /image (/img) الاسم ➠ إحضار صورة جميلة

⎙ مثال:
  /image او /img Car </b>
"""
